//useHistory() е предоставен от библиотеката React Router, който позволява на компонентите във функционален компонент да получават достъп до инстанцията на историята на браузъра и да извършват навигацията през него.

//За да използвате useHistory(), първо трябва да импортирате библиотеката react-router-dom:

import { useHistory } from 'react-router-dom';

const MyComponent = () => {
  const history = useHistory();

  const handleClick = () => {
    // Навигиране към определен път
    history.push('/new-path');
  };

  return (
    <button onClick={handleClick}>Go to new path</button>
  );
};


//Този пример демонстрира използването на useHistory() за промяна на текущия път на страницата, когато потребителят кликне върху бутона. Методът push() поставя новия път в историята на браузъра и презарежда компонентите на страницата с новия път.
